package kakao;

public enum ReportRsltCode {
	A1("발신_프로필_키가_유효하지_않음"),
	A2("서버와_연결되어있지않은_사용자"),
	A5("메시지_발송_후_수신여부_불투명"),
	A0("성공"),
	A6("메시지_전성결과를_찾을_수_없음"),
	A8("메시지를_전송할_수_없는_상태"),
	A9("최근_카카오톡_미사용자"),
	Aa("건수_부족"),
	Ab("전송_권한_없음"),
	Ac("중복된_키_접수_차단"),
	Ad("중복된_수신번호_접수_차단"),
	Ae("서버_내부_에러"),
	Af("메시지_포맷_에러"),
	Ak("메시지가_존재하지않음"),
	Ao("TIME_OUT처리"),
	Ap("메시지본문_중복_차단"),
	At("메시지가_비어있음"),
	AA("카카오톡_미사용자"),
	AB("알림톡_차단을_선택한_사용자"),
	AC("메시지_일련번호_중복"),
	AD("5초이내_메시지_중복발송"),
	AE("미지원_클라이언트_버전"),
	AF("기타_오류"),
	AH("카카오_시스템_오류"),
	AI("전화번호_오류"),
	AJ("050_안심번호_발송불가"),
	AL("L"),
	AM("템플릿을_찾을_수_없음"),
	AS("발신번호_검증_오류"),
	AU("메시지가_템플릿과_일치하지않음"),
	AV("메시지가_템플릿과_비교실패");
	
	private final String value;
	
	ReportRsltCode(String value){
		this.value = value;
	}
	
	public String getValue() {
		return value;
	}
	
	
	
	
}
